public class Agenda {
    public static void main(String[] args) {
    }
    /*
Лекція 1

 1. JVM, JDK, JRE
 2. версії джави
 3. примітиви
 4. операції
 5. if
 6. цикли
 7. switch
 8. методи
 9. String


Лекція 2

    1. Що можна отримати зі Sting-а
    2 Scope
    3. ООП
    4. Клас і об'єкт
    5 GC
    6. Поля
    7. Режим доступу
    8. Методи
    9. Static i non-static
    10. геттери і сеттери
    11. конструктор
    12. Успадкування


Лекція 3

    /part_1
    Поліморфізм
    Асоціація, Агрегація і Композиція.
    Як GC видаляє об'єкти.
    передача обєктів і примітивів у метод
    final class/method/field


    /part_2
    Object methods
    equals i hashcode
    як створити клас з константами
    абстрактні класи
    інтерфейси
    Приклад (нотифікейшини)







  Лекція 4

    Робота з датою
    Процес ініціалізації
    method overload example
    autoboxing
    switch + yield
    Приклад (ремонт квартири)


Лабораторна 3: простий планувальник з типами завдань, розрахунок книжок


     */


}
